app/views/tasks/show.html.erb

SELECT "comments".* FROM "comments" WHERE "comments"."task_id" = ?  [["task_id", 1]]
---
<ol>
  <% @task.comments.each do |comment| %>