app/views/projects/index.html.erb

<ol>
  <% Project.all.each do |project| %>
---
SELECT "projects".* FROM "projects"