app/controllers/comments_controller.rb

  def create
    @task = Task.find(params[:task_id])
    @comment = @task.comments.build(comment_params)

    if @comment.save
---
SELECT  "tasks".* FROM "tasks" WHERE "tasks"."id" = ? LIMIT 1  [["id", 1]]
INSERT INTO "comments" ("name", "email", "body", "task_id", "created_at", "updated_at") VALUES (?, ?, ?, ?, ?, ?)  [["name", "Eugenia"], ["email", "eugeniagrieff@gmail.com"], ["body", "gggggkkkkkkk"], ["task_id", 1], ["created_at", "2016-03-17 13:20:25.372638"], ["updated_at", "2016-03-17 13:20:25.372638"]]